let data = [
    {
        "id":0,
        "type": "lesson",
        "title": "الدرس الاول",
        "video": "../static/video/awesome-video.mp4",
        "sub-title": "ما هي معالجة اللغة الطبيعية NLP ؟",
        "desc": `
            تعتبر معالجة اللغات الطبيعية من المواضيع المثيرة للاهتمام في عصر أصبحت به التكنولوجيا شريكة البشر في كل المجالات تتم معالجة اللغات الطبيعية من خلال مراحل متكاملة مع بعضها للوصول إلى الهدف المطلوب.

            يفهم الكثير من المستخدمين للحاسبات وتكنولوجيا المعلومات العلاقة بين الحاسب واللغة على أن الحاسب قدم إمكانات كبرى اعانت – ولا تزال على دراسة اللغات الإنسانية وتحليلها وتبسيطها وتيسير تعليمها، أما اللغة فكانت ولاتزال هى الوعاء أو الوسيط الذي يتم من خلاله التفاعل بين الإنسان مع الحاسب يبدو أن العلاقة ليست كذلك بالضبط فالخبراء والعلماء والمتخصصون ينظرون إليها نظرة أخرى واضحة الاختلاف، تنطوي على الكثير من التعقيدات والجوانب الغامضة وغير المفهومة بالنسبة للكثيرين حيث تعتبر لغة الإنسان معقدة وغامضة وغير منظمة ومتنوعة، وهناك أكثر من ٦٥٠٠ لغة في العالم، كل منها لها قواعدها النحوية والدلالية، وحتى البشر يكافحون لفهم اللغة، لذا، لكي تفهم الآلات اللغات الطبيعية يجب أولا أن تتحول إلى شيء يمكنها تفسيره في معالجة اللغة الطبيعية، يعد بناء الجملة والتحليل الدلالي مفتاحاً لفهم البنية النحوية للنص وتحديد كيفية ارتباط الكلمات ببعضها البعض في سياق معين، لكن تحويل النص إلى شيء يمكن للآلات معالجته لا يزال معقدا، حيث يحتاج علماء البيانات إلى تعليم أدوات معالجة اللغات الطبيعية للنظر إلى ما وراء التعريفات وترتيب الكلمات، ذلك لفهم السياق والغموض في الكلمات والمفاهيم المعقدة الأخرى المرتبطة باللغة البشرية.

            تمتلئ الشركات ببيانات غير منظمة، ومن المستحيل عليها تحليل كل هذه البيانات ومعالجتها دون مساعدة. تهتم المعالجة الآلية للغات الطبيعية بدراسة اللسان البشري ومحاولة الاستفادة من العلوم الأخرى بغرض حوسبة اللغة و لا يخص الأمر لغة معينة. لم يعد يهتم البحث اللساني بالطرق التي بموجبها تتكون الجمل في لغة من اللغات فقط، وإنما أصبح موضوع اللسانيات يتسع ليشمل التعرف على الكيفية التي يشتغل بها الدماغ البشري، أي تحديد الآلة اللغوية ذاتها، في محاولة التعرف على سر تكوينها وطريقة اشتغالها لدى الإنسان عامة. ولعل هذا هو الإشكال الذي يثار والسر الذي استعصى فهمه حتى على العلوم الدقيقة التي تمتلك من الأدوات الإجرائية ما يمكنها من ذلك.

            علاقة اللغة بالحاسب بأنها علاقة منفعة متبادلة، فعلى جبهة اللغة يستخدم الحاسب حاليا لإقامة النماذج اللغوية وتحليل الفروع اللغوية المختلفة، ومن أمثلة تطبيقات الحاسب في مجال اللغويات الصرف الحاسوبي والنحو الحاسوبي والدلالة الحاسوبية والمعجمية الحاسوبية وعلم النفس اللغوى الحاسوبي. وفي المقابل اقتبس علماء الحاسب في تطويرهم للغات البرمجة الكثير من أسس اللغات الطبيعية ويسعون بخطى حثيثة إلى التقريب بين هذه اللغات الاصطناعية واللغات الطبيعية بهدف تسهيل التعامل مع الحاسب دون وسيط برمجي، فالهدف الأسمى لبرمجة الحاسب هو أن يتعامل الفرد معه مباشرة بلغته الطبيعية بدلا من اللغات الاصطناعية. نخلص منها إلى أن المعالجة الآلية للغة هى جهود تحاول إزالة الحواجز ما بين اللغة التي يستخدمها الإنسان العادى فى ظروفه الطبيعية، والحاسب كآلة ذات قدرات عالية في فهرسة وتخزين ومعالجة واستدعاء البيانات والمعلومات، بما يجعل الإنسان قادر على استثمار أقصى طاقات وإمكانات الحاسب بسهولة ويسر وعبر لغة التعامل الطبيعية، وبما يجعل الحاسب قادر على أن يفهم لغة الإنسان العادية الطبيعية على مستوى الكلمة والجملة والمعنى وينفذ ما يريده الإنسان عبر هذا الفهم.

            تتجلى أهمية برمجيات معالجة اللغات الطبيعية Natural Languages Processing) (NLP) في جعل الحوار بين الإنسان والآلة ممكنا بلغة أقرب ما تكون إلى اللغات الطبيعية التي يستخدمها في الحوار مع أقرانه، وذلك باستخدام الذكاء الاصطناعي فاللغة . منظومة من الرموز والمعاني والأصوات والقواعد التي يؤدي اندماجها إلى التخاطب مع الإنسان حيث يستخدم تعبير اللغات الطبيعية للإشارة إلى اللغات الإنسانية؛ كاللغة العربية والإنكليزية والروسية وغيرها لتمييزها من اللغات غير الطبيعية كلغات برمجة الكمبيوتر والشفرات السرية وغيرها. تستخدم هذه اللغات للتفاهم والاتصال سواء بين الإنسان والإنسان أو بين الإنسان والآلة، كما أن لكل منها مفرداتها ونحوها وقواعدها اللغوية التي تحدد كيفية بناء الجمل ومعناها الدلالي. يهدف هذا المجال إلى تأمين التخاطب المباشر بين الإنسان والكمبيوتر؛ كتابة أو كلاما بلغة الإنسان الطبيعية، بدلا من لغة البرمجة الجامدة والصعبة ،الفهم، وهذا يسهل على الإنسان جميع العادي استثمار الكمبيوتر تم إنجاز تقدم ملحوظ في مجال معالجة اللغات الطبيعية في الفترة الأخيرة، حيث تستعمل تقانات معالجة اللغات الطبيعية في الكثير من المجالات، مثل نظم الاستفادة من بنوك المعلومات التي تخزن الموسوعات و الكتب القيمة ونظم الإجابة عن الأسئلة، ونظم فهم الكلام وتوليده، ونظم قراءة النصوص وفهمها، ونظم تأليف النصوص، وغير ذلك.

            المعالجة الآلية للغات الإنسانية Natural Language Processing هي مجال فرعي يتبع الذكاء الاصطناعي واللغويات الحاسوبية ، ويعنى بدراسة مشكلات التوليد والفهم الآلي للغات الإنسانية الطبيعية، وتهدف أنظمة توليد اللغات الطبيعية إلى تحويل البيانات والمعلومات المخزنة في قواعد بيانات الحاسب إلى لغة بشرية تبدو طبيعية، أما أنظمة فهم اللغات الطبيعية فتحويل عينات ونماذج اللغات الإنسانية إلى تمثيل شكلى يسهل على برامج الحاسب تطويعه والتعامل معه.

            تعريف معالجة اللغات الطبيعيه NLP :

            معالجة اللغة الطبيعية Natural Language Processing أو اختصارا NLP هي العلم الذي يجمع بين اللغة وعدد من مجالات علم الحاسب الآلي، مثل تعلم الآلة Machine Learning التعلم العميق Deep Learning الشبكات العصبية الصناعية Artificial Natural Networks

            تعد معالجة اللغة الطبيعية أيضا مجال من أكثر مجالات الذكاء الاصطناعي Artificial Intelligence أهمية وصعوبة في نفس الوقت، فهي أساسية لتحسين أجهزة وآلالات الذكاء الاصطناعية، ولكن لديها أيضا العديد من التحديات التي سنناقشها فيما بعد في هذا الكتاب.

            ومعالجة اللغة الطبيعية ليست علمًا حديثا بل أن أصولها النظرية ترجع إلى مئات الأعوام وبداية وجودها الفعلي تعود إلى ٦٠ عام من اليوم، وهي تحاول دمج خوارزميات الحوسبة اللغوية computational linguistics بالإضافة إلى الخوارزميات الإحصائية الخاصة بتعلم الآلة والتعلم العميق، وذلك لجعل الآلة قادرة على فهم اللغة ومعانيها المعقدة.

            تستخدم هذه التقنية في العديد من الأشياء التي نستخدمها يوميًا، بدءًا من محركات البحث Search Engines ، وأنظمة الكتابة، وتصحيح الأخطاء في لوحات كتابة الهواتف المحمولة، وحتى في البحث الطبي ومجالات المال والأعمال والبحث الأكاديمي، وسوف نتحدث عن العديد من استخدامات الـ NLP

            والمقصود باللغة الطبيعية في الـ NLP هي اللغات البشرية كالعربية والإنجليزية التي نشأت وتطورت بدون تخطيط أو قواعد موضوعة مسبقا، ولديها العديد من اللهجات المحلية و اللهجات العامية المختلفة، كما أنها تتطور تلقائيًا، ولذا تتطلب تحديثا في استخراج قواعدها مع مرور الوقت.

            أما اللغة الاصطناعية Artificial Language ، فهي مثل لغات البرمجة ك Python وغيرها، والتي وضع الإنسان قواعدها ،ومصطلحاتها وهي عادة لا تستخدم بين البشر وبعضهم البعض، وإنما بين البشر والحواسيب لكونها واضحة ومباشرة، ولا تحتوي على أي غموض أو لبس لغوي أو احتمال لوجود معنى آخر لأوامرها

            يتم تعريف معالجة اللغات الطبيعية علي النحو التالي: عبارة عن تقنية تعلم الآلة تمكن أجهزة الكمبيوتر من تفسير اللغة البشرية ومعالجتها وفهمها.

            معالجة اللغة الطبيعية : جعل الآلة قادرة على فهم اللغة البشرية وتوليدها، سواء اللغة المكتوبة أو اللغة المسموعة، كما تحاول تحسين التواصل الذي يتم بين الإنسان والآلة، وجعله يشابه ما يحدث بين الإنسان والإنسان.

            معالجة اللغات الطبيعية (NLP) عبارة عن تقنية تعلم الآلة تمكن أجهزة الكمبيوتر من تفسير اللغة البشرية ومعالجتها وفهمها. تمتلك المؤسسات اليوم كميات كبيرة من البيانات الصوتية والنصية من قنوات اتصال مختلفة مثل رسائل البريد الإلكتروني، والرسائل النصية وموجزات الأخبار على وسائل التواصل الاجتماعي والفيديوهات، والمقاطع الصوتية والمزيد وهي تستخدم برمجيات معالجة اللغات الطبيعية (NLP) لمعالجة هذه البيانات تلقائيا وتحليل النية أو المشاعر في الرسالة والاستجابة في الوقت الفعلي للتواصل البشري.

            أهداف معالجة اللغات الطبيعية :-

            المعالجة الآلية للغة ظهرت في الأساس من أجل تطوير وإنشاء وصياغة تطبيقات الترجمة الآلية سواء كانت مكتوبة أو منطوقة، والترجمة الآلية هى الوسيلة الوحيدة التي تستطيع بها الأمم مواكبة الانفجار المعرفي والمعلوماتي في عصر الإنترنت الساحق وفضاءاتها الإلكترونية الواسعة. حيث لا يستطيع أى مجتمع أو أمة مهما كانت أن تعيش بمعزل عن هذه الثورة المعرفية أمام اكتساح اللغة الإنجليزية لكل المراجع المعرفية والمعلوماتية في فضاء الإنترنت وانتشارها بشكل يهدد بانسحاق كل الأمم واللغات التى لا تستخدم تكنولوجيا المعلومات والحاسب في اللحاق بعصر المعلومات.

            ومن أحد أهداف وتطبيقات المعالجة الآلية للغة مساعدة المستخدم والإدارى والعالم والمسئول الحكومي فى عصر فيض وطغيان المعلومات على الوصول للمعلومات التي يريدها بسهولة وسرعة من خلال التلخيص الالى والتحليل الآلى للنصوص بالإضافة إلى البحث الذكي عن المعلومات فى شبكة الإنترنت فى أجيالها الجديدة التى تعرف باسم الويب الدلالية.

            ويؤدى التطور فى تطبيقات المعالجة الآلية للغة إلى تسهيل حصول المرء على المعلومة في أي مكان وأى وقت، ومن أمثلة السيناريوهات المستقبلية لتوضيح هذا الأمر تخيل نفسك أنك تقود سيارتك في رحلة لقضاء عطلة الصيف في الساحل الشمالي، وكنت تريد متابعة أسهم شركتك في البورصة، فماذا ستفعل؟ ستخاطب حاسب السيارة قائلا أريد تقريرا تفصيليا عن حالة أسهم شركة ما فى البورصة خلال اليومين الماضيين؟ ماذا الذى سيحدث؟ سيقوم حاسب السيارة بتحويل عبارتك الصوتية إلى أوامر بحث نصية ويرسلها إلى شبكة الإنترنت عبر التقنيات اللاسلكية المتقدمة، وستقوم شبكة الإنترنت بفحص أسهم شركتك خلال اليومين السابقين وترسلها إلى حاسب السيارة مرة أخرى الذى يحول المعلومات النصية إلى كلام منطوق تسمعه بأذنيك لأنك بطبيعة الحال تركز في القيادة.
            ويمكن اختصار أهداف المعالجة الآلية للغات الإنسانية بصفة عامة في ثلاثة أهداف هي:

            １-	تواصل أفضل مع الحاسب :-

            تمكن وسائل البحث باللغة العادية الإنسان من التواصل مع الحاسب بالفرنسية أو الألمانية أو العربية أو أى لغة أخرى فالتواصل مع الحاسب باللغة المنطوقة سيكون له تأثير كبير على بيئة العمل، وستنبثق مجالات جديدة واسعة أمام تكنولوجيا المعلومات.

            ２-	 تواصل أفضل بين البشر :-

            من الأهداف الأولى التى ظهرت من أجلها علوم اللغويات الحاسوبية والمعالجة الآلية الترجمة الآلية بين اللغات الحية من أجل مزيد من التواصل بين البشر ، ورغم أن تجربة الفشل المريرة قد جعلت العلماء يدركون أنهم بعيدون جدا عن تحقيق هذا الهدف الطموح في ترجمة النصوص غير المحدودة، تمكن علماء اللغويات الحاسوبية من إنشاء برمجيات تبسط عمل المترجم البشرى وتحسن من إنتاجيته إلى حد كبير، وتقدم الترجمة الآلية الركيكة أو الحرفية مساعدة كبيرة لباحثي المعلومات الذين يبحثون عن المدلول أو المعنى في كميات كبيرة من النصوص باللغات الأجنبية.

            ３-	الوصول الفعال للمعلومات :-

            تصفح المعلومات على الويب والتنقل بينها وفلترتها ومعالجتها يتطلب تطوير برمجيات يمكنها الوصول إلى المعلومات فى المستندات والوثائق وصفحات الويب، وهكذا فإن تكنولوجيا اللغات الإنسانية لإدارة المحتوى شرط ضرورى لتحويل ثروة المعلومات الرقمية إلى معرفة جماعية، وتعدد لغات المحتوى على الويب يمثل تحديا إضافيا لتكنولوجيا اللغة، لأنه لا يمكن السيطرة على الويب العالمية إلا بمساعدة الأدوات متعددة اللغات لفهرسة وتصفح الويب، وستذلل أنظمة إدارة المعرفة والمعلومات متعددة اللغات عقبات اللغة أمام التجارة الإلكترونية والتعليم عن بعد.

            أسباب الاهتمام بمعالجة اللغات الطبيعية :-

            -	التطور الهائل في علوم اللغويات وخضوعها للمعالجة الرياضية والمنطقية. 
            -	ظهور النظم الآلية الخبيرة التى تستطيع تشخيص الأمراض وتقديم الاستشارات الفنية والقانونية والنظم الآلية للتعليم الذاتي التي تتطلب قدرة على الحوار مع المستخدم البشرى بلغة سهلة مثل لغته الطبيعية.
            -	  انتشار الحاسب كوسيلة للتعليم والتعلم، وخاصة تعليم وتعلم اللغات.
            -	التقدم العلمي في تقنيات الحاسب ومكوناته ولغات برمجته وأساليب الذكاء الصناعي. 
            - الاستعانة باللغات البشرية في تصميم لغات برمجة راقية تتسم بالقوة والمرونة.
            -	يتطلب الانفجار المعرفي استحداث وسائل آلية لتنظيم هذا الكم المتزايد من المعلومات وتحسين كفاءة تخزينها واسترجاعها وتوظيفها.
            -	انتشار الحاسبات الشخصية والمنزلية بشكل يحتم ضرورة التعامل معها بلغة طبيعية .
            -	 بفضل الحاسبات السوبر أمكن تطوير نظم لمعالجة اللغة آليا في حدود الجدوى الاقتصادية والفنية لهذه النظم

            ما سبب أهمية معالجة اللغات الطبيعية (NLP) ؟

            تعد معالجة اللغة الطبيعية أمرًا بالغ الأهمية لتحليل بيانات النص والكلام تحليلا كاملا وبكفاءة. يمكن أن تعمل من خلال الاختلافات في اللهجات واللغة العامية والأخطاء النحوية المعتادة في المحادثات اليومية تستخدمها الشركات في العديد من المهام الآلية، مثل:

            . معالجة المستندات الكبيرة وتحليلها وأرشفتها
            . تحليل ملاحظات العملاء أو تسجيلات مراكز الاتصال
            . تشغيل برامج الدردشة الآلية الخاصة بخدمة العملاء الآلية
            . الإجابة على أسئلة من وماذا ومتى وأين
            . تصنيف النص واستخراجه

            أنواع معالجة اللغة الطبيعية NLP :-

            هناك العشرات من أنواع وتقنيات Techniques معالجة اللغات الطبيعية التي لها المئات من الاستخدامات والتطبيقات التي تسهل علينا حياتنا كل يوم.

            وإليك نبذة عن النوعين الأكثر أهمية لمعالجة اللغة الطبيعية NLP :

            في هذا الكتاب سوف نتطرق إلى أهم التقنيات الخاصة بمعالجة اللغات الطبيعية، ولكن قبل ذلك علينا التوضيح بأنه يمكن تقسيم هذه الأنواع والتقنيات إلى قسمين كبيرين، هما:
            فهم اللغة الطبيعية Natural Language Understanding أو NLU

            هذا الجزء يتعلق بالتعامل مع اللغة الطبيعية وفهمها بعد تقديمها كمدخلات للحاسوب أو الآلة سواء كانت هذه اللغة مقدمة على هيئة نص أو صوت، فالهدف هنا هو جعل الآلة تفهم اللغة الطبيعية.

            توليد اللغة الطبيعية Natural Language Generation أو NLG

            توليد اللغة الطبيعية هي التقنية التي تتيح للالة بأن تستطيع توليد محتوى سواء نصي أو صوتي يشابه هذا الذي قد يولده الإنسان العادي، أي أنه في هذه التقنية تتعامل الآلة مع اللغة على أنها مخرجات لا مدخلات.

            التطبيقات المتعددة لمعالجة اللغة الطبيعية :-

            １-	التعرف على الكلام Speech recognition

            يتم استخدام هذه التقنية على نطاق واسع هذه الأيام، وتستخدم من أجل تحويل البيانات الصوتية إلى بيانات نصية، وهذا بهدف إعطاء الأوامر الصوتية أو طرح بعض الأسئلة بشكل صوتي بدون الحاجة إلى الكتابة. 
            تواجه هذه التقنية العديد من التحديات مثل تعدد اللهجات والنطق غير الصحيح، والكلمات المتشابهة، والأخطاء اللغوية، وغيرها الكثير، ولكن على الرغم من هذا فإننا نشهد تطورا ملحوظا في تطبيقاتها Siri Alexa

            قد تستخدم تقنية التعرف على الكلام Speech recognition في أنظمة المساعدة الافتراضية وفي خدمة العملاء والاستجابة إلى شكواهم وعشرات الاستخدامات غيرها.

            في هذا التطبيق أيضا لا يتعرف على نص مكتوب ويحوله إلى كلام منطوق، بل يستمع إلى صوت مسموع ويقوم بالتعرف عليه وتحديد هوية صاحبه، من خلال تحويل الصوت إلى رموز تفهمها الآلة وتتعرف عليه، وهو يختلف كذلك عن مصطلح التعرف على الصوت Voice Recognition ويقصد به التعرف على صوت المتحدث نفسه وليس الكلام الذي يقوله. ومن تطبيقات فهم الكلام الاتصالات الصوتية وتوجيه المكالمات والتحكم في الأجهزة المنزلية والبحث في المحتوى بالصوت وإدخال البيانات البسيطة وإعداد المستندات المنظمة وتحويل الكلام إلى نص مكتوب وفى كابينات القيادة بالطائرات

            و من تطبيقات فهم الكلام المنطوق استخدامها في القيادة الآلية للطائرات العسكرية والتحكم في أجهزتها وخاصة في بريطانيا وفرنسا والولايات المتحدة وفى طائرات الهليكوبتر حيث مشكلة الضوضاء الخلفية بسبب صوت المروحة والهواء وفى إدارة المعارك حيث تتطلب مراكز القيادة الوصول السريع لقواعد بيانات المعلومات المتغيرة بسرعة كما تستخدم في تدريب مراقبي حركة المرور الجوي، بجانب استخدامها في مجال الاتصالات التليفونية والعاب الحاسب والمحاكاة، ولم يتم تثبيت هذه التكنولوجيا في الأجهزة المحمولة لأنها تتطلب قوة معالجة هائلة، وهذه التكنولوجيا مفيدة للغاية لمن لا يستطيعون تحريك أيديهم، مما يتطلب وسيلة بديلة لإدخال المعلومات في الحاسب والتحكم في وظائفه. 
            ２-	 تصنيف النصوص Text Classification

            تصنيف النصوص هو واحد من أكثر تقنيات معالجة اللغة الطبيعية استخدامًا وتشعبا في وقتنا هذا، فهذه التقنية قد تم تطويرها منذ بدايات نشأة الـ NLP ، بجانب هذا فهي الأكثر انتشارًا واستخداما في حياتنا اليومية، على سبيل المثال في تصنيف رسائل البريد الإلكتروني الخاصة بنا

            من خلال هذه التقنية نستطيع التعامل مع النصوص بمختلف أشكالها وأغراضها، ومن ثم نقوم بتوزيعها على تصنيفات مختلفة بناءًا على محتواها، ومن أبرز التقنيات الفرعية لتصنيف

            النصوص: Text Classification

            أ‌)	تصنيف الموضوعات Topic Classification

            باستخدام هذه التقنية تتم معالجة النصوص المختلفة ومن ثم تحديد موضوعاتها الأساسية، ومن ثم ترتيبها حسب المواضيع الخاصة بها ووضعها في التصنيفات المناسبة لها.

            تساعد هذه التقنية عند التعامل مع النصوص الكثيرة التي يصعب على الإنسان قراءتها، ووضعها في تصنيفات محددة سواء لصعوبتها أو لأخذها وقنا وجهدًا كبيرًا.

            كما تقوم العديد من الشركات باستخدام هذه التقنية في إدارة مشاكل العملاء خاصتها، حيث تمرر شكوى العملاء على مصنف ليضعها في تصنيفات محددة حسب النصوص بداخلها.

            (ب) تحديد النية Intent Detection

            في هذه التقنية تقوم خوارزميات الذكاء الاصطناعي بالتعرف على الغايات والأهداف والنية من وراء النصوص أو الحديث، ولذا هذه التقنية تساعد العديد من الشركات على تحسين وإدارة أقسام كخدمة العملاء أو المبيعات بداخلها.

            (ج )الإسناد إلى الكاتب الحقيقي Authorship Attribution

            هذه التقنية مثيرة للغاية إذ أنها تتعامل مع الأعمال الإبداعية التي تثير الجدل حول مؤلفيها حيث من خلال تغذية الخوارزمية بالأعمال المختلفة للمؤلفين موضع الشك، ومن ثم تغذيتها بالعمل محل الجدال، تستطيع أن تنسب العمل لمؤلفه الحقيقي.

        `,
    },
    {
        "id":1,
        "type": "lesson",
        "title": "الدرس الثانى",
        "video": "../static/video/awesome-video.mp4",
        "sub-title": "استخلاص النصوص Text Extraction",
        "desc": `
            تقنية أخرى مهمة من تقنيات معالجة اللغة الطبيعية NLP هي استخلاص النصوص Text Extraction، وهي تقنية تساعد على توفير الكثير من الوقت والجهد عند الحاجة إلى البحث عن معلومات أو أجزاء محددة من النصوص بداخل كتب أو محتوى كبير للغاية وواسع.

            وهناك العديد من الخوارزميات والتقنيات المهمة التي تندرج تحت التقنية الكبرى لاستخلاص النصوص:

            (1)	استخلاص الكلمات المفتاحية Keyword Extraction

            تستطيع هذه التقنية بشكل أتوماتيكي أن تقوم باستخلاص أهم الكلمات المفتاحية والتعبيرات في نص أو مجموعة من النصوص، ويتم استخدام هذه التقنية بكثرة في محركات البحث Search Engines 

                (ب )استخلاص الأسماء ذات الدلالات Named Entity Recognition أو NER

            هذه التقنية مهمة للغاية إذ أنها تجعل الآلة قادرة على التجاوب بشكل أفضل مع اللغة الطبيعية حيث إنها تستطيع استخلاص الكلمات المقصود بها دلالات أخرى، مثل أن تكون اسم لشخص مشهور، اسم لفيلم أو مسلسل أو حتى اسم مكان.
            ４-	 الترجمة الآلية Machine Translation

            وتعنى استخدام برمجيات الحاسب في ترجمة النصوص أو الكلام من لغة إنسانية لأخرى. وفي مستواها الأساسي، تعمل برامج الترجمة الآلية على استبدال الكلمات باللغة المترجم منها بالكلمات المقابلة لها فى اللغة المترجم إليها من الممكن استخدام تقنيات الميكانزمات في إجراء عمليات ترجمة أكثر تعقيدا حيث تساهم الميكانزمات والذخائر اللغوية في التعامل مع الفروق في البنية اللغوية والتعرف على العبارات وترجمة المصطلحات بالإضافة إلى عزل الحالات الشاذة.

            تتيح برمجيات الترجمة الآلية الحالية تخصيص الترجمة حسب المجال أو المهنة، حيث يتم تحسين الترجمة النهائية من خلال حصر نطاق الاستبدالات المسموح بها، وهذا الأسلوب فعال للغاية خاصة في المجالات التى تستخدم فيها اللغة الرسمية أو الاصطلاحية، وبصفة عامة تتيح الترجمة الآلية نتائج أفضل فى النصوص الحكومية والقانونية التى تعتمد على قوالب من الجمل والعبارات بعكس النصوص العامة والمحادثات، حيث ما زالت نظم الترجمة الآلية في حاجة إلى مزيد من التطوير للوصول إلى جودة معقولة.

            ومما لا شك فيه أن الترجمة الآلية بصفة عامة وصلت إلى مستوى متقدم جدا، ونجحت في مساعدة المترجم البشرى على تحسين عمله بل وتفوقت عليه في أحيان قليلة، غير أنها في مجملها لم تستطع أن تتغلب على المترجم البشرى فى هذا المضمار، خاصة في ترجمة الحوارات والمحادثات ويزيد الأمر صعوبة لو كانت هذه الحوارات باللغة العامية أو اللغة غير الرسمية.

            وتستخدم الترجمة الآلية طريقة تعتمد على القواعد اللغوية التى تعنى ترجمة الكلمات بطريقة لغوية، حيث يتم استبدال الكلمات المناسبة فى اللغة الهدف بالكلمات المقابلة لها في اللغة المصدر، وهناك بعض الآراء التى ترى أنه لن يكتب للترجمة الآلية تحقيق النجاح ما لم تحل مشكلة فهم اللغات الطبيعية أولا.
            وتوجد عدة طرق للترجمة الآلية هي الترجمة المعتمدة على القواعد أو المعتمدة على الإحصاء.

            1-	الترجمة المعتمدة على القواعد

            تقوم لوغاريتمات الترجمة المعتمدة على القواعد بإعراب النص وإنشاء تمثيل وسيط رمزي يتم منه توليد النص باللغة الهدف، ووفقا لطبيعة التمثيل الرمزي، يوصف منهج الترجمة الآلية بأنه معتمد على التمثيل المحايد أو التحويل وتتطلب هذه المناهج معاجم شاملة بمعلومات دلالية وتركيبية وصرفية ومجموعة كبيرة من القواعد.

            ٢- الترجمة المعتمدة على الإحصاء

            تحاول الترجمة الآلية الإحصائية توليد الترجمة باستخدام الطرق الإحصائية المعتمدة على ذخيرة لغوية ثنائية اللغة، فإذا توافرت هذه المكانز، يمكن تحقيق جودة ممتازة في الترجمة الآلية لأى نصوص مشابهة، وأول برنامج للترجمة الإحصائية هو CANDIDE من أي بي ام، وقد استخدمت شركة جوجل SYSTRAN لعدة سنوات ثم انتقلت إلى طريقة الترجمة الإحصائية في أكتوبر ۲۰۰۷ ، وقامت جوجل مؤخرا بإضافة ۲۰۰ مليار كلمة من مواد الأمم المتحدة لتدريب أنظمة الترجمة الآلية، حيث تحسنت جودة الترجمة كثيرا.

            تطبيقات الترجمة الآلية

            -	المساعدة على الفهم مع الانفجار المعلوماتي وتطور النشر العالمي مع استخدام لغات مختلفة أصبح الباحث يلجأ إلى المترجم الآلي للحصول على المعلومات الضرورية لبحثه
            -	 وسيلة رفع الإنتاجية مع ظهور العولمة واتجاه المؤسسة إلى الإنتاج الخارجي أصبح ضروريا عليها مخاطبة الزبائن بلغاتهم ونشر المعلومات عنها (تعريف المنتوج) في المطبوعات مواقع الويب والنشر بلغاتهم المختلفة وهذا العمل يتطلب كفاءة عالية كما أنه عمل روتيني لذا لجأت المؤسسات إلى برامج الترجمة لربح الوقت.
            ويمكن أن تذكر مثال Reverso التي ربحت ما بين 60-30 من وقت العمال في الترجمة باستخدامها برنامج الترجمة من اللغة الإنجليزية إلى مختلف اللغات الأخري تحليل النص المصدر
            -	تطبيق القواعد اللغوية
            وتتكون القواعد اللغوية من: قواعد ترتيب الكلمات المعلومات الإعرابية والنحوية
            المورفولوجيا، تحليل الجمل الدلالة.
            -	 تعميم الترجمة
            -	 القواميس: إن القواميس المدمجة في برمجيات الترجمة الآلية ليست قواميس بها مجموعة كلمات بلغتين أو أكثر بل تحوي كلمات بها معلومات لغوية مورفولوجية دلالية، نحوية في اللغة الأم م واللغة المترجم اليها.

            ５-	 تحليل المشاعر Sentiment Analysis

            تحليل المشاعر Sentiment Analysis هي واحدة من أشهر تقنيات الـ NLP والتي لفتت أنظار العالم في الأونة الأخيرة، فهذه التقنية تحاول فهم المشاعر التي تكمن وراء النصوص وتحديد المواقف الناتجة عنها سواء كانت مشاعر معينة أو حيرة أو سخرية أو شك أو شيء آخر.

            واليوم تستخدم العديد من الشركات هذه التقنية من أجل الرد التلقائي على عملائهم، فهي تستطيع تمييز الشكوى من المدح والتجاوب مع الاثنين بالطرق المناسبة حسب الأوامر المحددة من قبل الشركة.

            ６-	تلخيص النصوص الآلي Automatic Text Summarization

            أتمتة عمليات التلخيص كانت أولوية لدى متخصصين معالجة اللغة الطبيعية على مدى عقود وهذا لكون هذه التقنية تستطيع أن توفر علينا نحن البشر الكثير من الوقت والمجهود اللذان نستغرقهم في أداء هذه المهمة الصعبة.
            والآن يستطيع الباحثون أن يقوموا بتلخيص العشرات من الأبحاث العلمية بمختلف تخصصاتها بدون بذل جهد كبير في معالجتهم والتعامل معهم ما ساعد على توفير وقت كبير لهم في أداء التجارب والأبحاث الخاصة بهم.

            والتلخيص الآلي للنصوص يعد تطبيق من تطبيقات المعالجة الآلية للغة يقوم إنشاء نص مختصر من ملف أو مستند بواسطة برنامج حاسب آلي، على أن يحتوى النص المختصر على أهم الأفكار في النص الأصلي، وتأتى أهمية التلخيص الآلى في ضوء إغراق المعلومات وزيادتها عن قدرة المرء على الملاحقة والمتابعة. ينبغى على البرمجيات التي طورت التقدم خلاصات متماسكة أن تأخذ فى الاعتبار عدة متغيرات مثل الطول وأسلوب الكتابة والبناء من أجل إنشاء ملخص مفيد.

            ويمكن التمييز بين نوعين من برامج التلخيص الآلي برامج الاستخلاص والتجريد. تعتمد برمجيات الاستخلاص على نسخ المعلومات التى تعد مهمة إلى الملخص (مثل الجمل الأساسية والفقرات المهمة أما التجريد أو التركيز فيتطلب إعادة الصياغة، وبصفة عامة، يعد التجريد وإعادة الصياغة أقوى تأثيرا ويركز المعلومات بصورة أكبر من الاستخراج، ولكن البرامج التي تقوم بذلك صعبة للغاية في البرمجة والتطوير لأنها تتطلب تكنولوجيا توليد اللغة الطبيعية التي ما زالت حتى الآن مجالا متناميا.

            ７-	تحليل أراء العملاء Customer Feedback Analysis

            العديد من الشركات تستخدم معالجة اللغة الطبيعية NLP في تحليل أراء عملائها على منصات التواصل الاجتماعي، وخاصة تويتر، فمن خلال الخوارزميات المتخصصة أن تعرف أراء العملاء عن منتجاتك والتحسينات التي يرغبون بها وكل تعليقاتهم. ومن خلال هذا تستطيع عمل مسح موسع لأراء عدد كبير من العملاء بتكلفة أقل وبوقت أقل بكثير، وهذا شيء ضروري للغاية خاصة إذا كانت شركتك تخدم الملايين من العملاء
            ８-	أتمتة مهام خدمة العملاء Automation of Customer Support Tasks
            تواجه أقسام خدمة العملاء في المتوسط المئات من الطلبات والشكاوى يوميا، وعادة ما تكون هذه الأمور مكررة، ولذا تلجأ بعض الشركات إلى أتمتة المهام المتكررة وتقليل عدد العاملين فى أقسام خدمة العملاء، وهذا ما يوفر عليهم أموال كثيرة ويزيد من كفاءة القسم. 
            ９-	تطبيقات المحادثة Chatbots 
            تطبيقات المحادثة Chatbots هي واحدة من أكثر تطبيقات معالجة اللغة الطبيعية شهرة، حيث من خلال الخوارزميات الذكية يمكنك بسهولة توفير ذكاء اصطناعي يرد على عملائك ردود ذكية بشرية، كما يمكنك توفير أنظمة خبراء قادرة على إجابة . أسئلة عملائك. جميع هناك الكثير من التطبيقات الشهيرة حاليا التي تستخدم هذه الخوارزميات، ومن أبرزها أنظمة المساعدة الافتراضية مثل CIRI الخاصة بابل ومساعد جوجل الخاص بجوجل.

            １０-	 تحليل وتصنيف السجلات الطبية Analysis and Categorization of Medical

            Records

            بفضل تطور تقنيات الـ NLP أصبح بإمكاننا تصنيف ومراجعة السجلات الطبية بدون أي تدخل بشري من خلال خوارزميات بسيطة، كما بإمكاننا تحليل هذه السجلات واستخراج المعلومات التي نريدها بشكل أتوماتيكي. هذه التطبيق سيجعلنا قادرين على فهم الأمراض والمرضى بشكل أكثر تطوراً، كما أنه سيجعلنا قادرين على التحكم ومنع انتشار الأمراض المعدية.
            １１-	 التنبؤ بالنصوص Text Prediction

            هذا التطبيق نقوم باستخدامه العديد من المرات يوميا من خلال التنبؤ بالنصوص والتصحيح التلقائي وهما الميزتان الموجودتان على هواتفنا المحمولة، كما أنه يُستخدم بكثرة في محركات البحث

            １２-	 التدقيق اللغوي Proofreading

            العديد من برامج النصوص مثل مايكروسوفت وورد تستخدم تقنيات معالجة اللغة الطبيعية من أجل مراجعة الأخطاء النحوية وتصحيح هذه الأخطاء، وهناك تطبيقات متخصصة فقط في هذا الأمر تقوم بهذا، مثل Grammarly :

            １３-	فلترة رسائل البريد الإلكتروني Email Filters

            هذا التطبيق الذي يساعد على تصنيف البريد الإلكتروني الخاص بـ Gmail جيميل إلى الرسائل الأساسية الرسائل الاجتماعية الرسائل الترويجية بالإضافة إلى تحديد االرسائل المهملة.

            １４-	كشف الانتحال Plagiarism Detection

            مسألة الانتحال Plagiarism مهمة للغاية في الأوساط الأكاديمية، فهي تقارن النصوص التي كتبها الباحثون بتلك المكتوبة من نقل لتحديد نسبة الاقتباس في نصوصهم وأبحاثهم. الصعوبة القيام بهذا يدويًا فإن التطبيقات التي تقوم باستخدام الـ NLP ساعدت المجتمع العلمي كثيرا في هذا الشأن.
            １５-	 التوليد الآلى للغة

            يقصد بالتوليد الآلى اللغة إنشاء نص بلغة طبيعية من نظام تمثيل الى مثل قاعدة معرفة أو استمارة منطقية، وبعض الناس يعتبر التوليد الآلى للغة كمقابل لفهم اللغة الطبيعية، وفي نظم إنشاء التوليد الآلى للغة، يحتاج النظام إلى اتخاذ قرارات بشأن كيفية صياغة أحد المفاهيم. وأنجح التطبيقات للتوليد الآلى للغة أنظمة تحويل البيانات إلى نصوص التي تقوم بإعداد خلاصات نصية للبيانات الرقمية وغير اللغوية حيث تمزج بين تحليل البيانات والتوليد الآلى للغة مثل النشرات الآلية لأحوال المناخ والاقتصاد والبورصة.

            １６-	 التنقيب في النصوص

            يقصد به عملية استخلاص معلومات عالية الجودة من النصوص وتستمد المعلومات عالية الجودة من تقسيم الأنماط والاتجاهات من خلال وسائل مثل التعلم الإحصائي للأنماط وتتضمن عملية التنقيب في النصوص هيكلة النصوص المدخلة من خلال الإعراب الفك إلى الوحدات اللغوية مع إضافة مزايا لغوية مشتقة وإزالة مزايا أخرى والإدخال التالي في قاعدة البيانات واشتقاق الأنماط داخل البيانات المهيكلة وفى النهاية تقييم وتفسير المخرجات تتضمن مهام التنقيب في النصوص تصنيف النصوص وعنقدتها واستخراج المفاهيم والهويات وإنتاج التصنيفات المتدرجة وغيرها. وتستخدم تقنيات التنقيب في النصوص في تطبيقات الحماية والرعاية الطبية والبرمجيات والتطبيقات وتحسين نتائج البحث وأغراض التسويق والتطبيقات الأكاديمية.

            １７-	 التعرف الضوئى على الحروف Optical Character Reading

            يقصد بالتعرف الضوئي على الحروف OCR التحويل الميكانيكي أو الإلكتروني لصور الكتابة اليدوية أو الكتابة بالآلة الكاتبة أو النص المطبوع، والتى يتم عادة التقاطها بالماسحة الضوئية إلى نص قابل للتحرير والقراءة فى الحاسب. وقد بلغت تقنية التعرف الضوئي على الحروف شأوا كبيرا في اللغات اللاتينية بل لم تعد مشكلة على الإطلاق، وفى اللغة العربية توجد تطبيقات متطورة للتعرف الضوئي على الحروف العربية المطبوعة من صخر غير أنها باهظة التكلفة وقليلة الانتشار. وما زال التعرف الضوئى على الكتابة باليد أو الكتابة المنحنية المتصلة مجالا للبحث النشط سواء فى اللغات اللاتينية أو اللغة العربية.

            １８-	 نمذجة الموضوعات

            أمر مشابه لتصنيف الموضوعات، يجد هذا المثال الخاص بمعالجة اللغة الطبيعية الموضوعات ذات الصلة في النص عن طريق تجميع النصوص ذات الكلمات والتعبيرات المتشابهة، وعندما لا تكون بحاجة إلى إنشاء قائمة بالتصنيفات المحددة مسبقاً أو وضع بيانات تحت أي تصنيفات فهو خيار جيد للتحليل الاستكشافي، أي عندما لا تكون على دراية ببياناتك بعد.

            １９-	تحويل النص إلى كلام منطوق

            من التطبيقات المهمة للمعالجة الآلية للغة، فهو يقوم بقراءة النصوص أو تحويل الكلام المكتوب إلى صوت مسموع وكلام منطوق مفهوم، ويسمى نظام الحاسب برمجيات أو أجهزة) المستخدم لهذا الغرض بمولف الكلام، ويقوم نظام تحويل النص إلى كلام بتحويل نص اللغة العادية إلى كلام، أما الأنظمة الأخرى فتعمل على تحويل الرموز اللغوية الصوتية إلى كلام يمكن إنشاء الكلام المؤلف من خلال ضم أجزاء متسلسلة من الحديث المسجل المخزن في قاعدة بيانات هي المكائز المنطوقة، وتختلف الأنظة فى حجم وحدات الحديث المخزنة، وفي مجالات استخدام معينة، يتيح تخزين كلمات كاملة أو جمل كاملة إنتاج كلام عالى الجودة. وهناك طريقة أخرى هى تضمين نموذج من جهاز النطق وغيرها من خصائص الصوت الإنساني لإنتاج صوت مولف بالكامل.

            ويتم الحكم على جودة مولف الكلام بدرجة تماثله مع الصوت البشرى أو بمدى فهمه، ويتيح برنامج تحويل النصوص إلى كلام مفهوم للمكفوفين والمعاقين بصريا الاستماع إلى الأعمال المكتوبة من خلال الحاسب المنزلي، وقد تضمنت العديد من أنظمة تشغيل الحاسب مولفات كلام منذ بداية الثمانينات. المشكلة التي تواجه إنتاج مولفات كلام باللغة العربية هي غياب علامات التشكيل، ولهذا لابد من إنتاج المشكل الآلى حتى يمكن تحويل النصوص العربية إلى كلام منطوق.

        `,
    },
    {
        "id":2,
        "type": "lesson",
        "title": "الدرس الثالث",
        "video": "../static/video/awesome-video.mp4",
        "sub-title": "تطبيقات معالجة النصوص:",
        "desc": `
            ان لخوارزميات معالجة النصوص تطبيقات مختلفة بعضها قد لا يبدو متوقعا كاستخدام مباشرة لها ونذكر هنا بعضها لتوضيح حجم وأثر معالجة النصوص على واقع العلم الحديث:

            １.	التطبيقات الطبية الحيوية : (Biomedical) حيث تم الاستفادة من خوارزميات معالجة النصوص في هذه المجالات لاستخلاص أنماط الأعراض من بيانات المرضى، وكذلك من سلاسل الأحماض النووية، ومن بين هذه الخوارزميات خوارزميات نمذجة المواضيع Topic Modeling .
            ２.	تطبيقات تسويقية حيث يستفاد من تقنيات معالجة النصوص في التعرف على طبيعة علاقة الشركات بعملائهم وآرائهم وانطباعاتهم حول منتجات وخدمات الشركات. 
            ３.	علم الاجتماع الحسابي : (computational sociology) حيث يتم الاستعانة بتقنيات تجميع النصوص والترجمة الآلية والتعلم العميق لتحليل النصوص الهائلة المتوافرة على الإنترنت ومن عدة لغات من قبل علماء الاجتماع للبحث والاستكشاف.

            المجالات التي تستخدم معالجة اللغة الطبيعية :-

            تعمل معالجة اللغة الطبيعية على تبسيط وأتمتة مجموعة واسعة من عمليات الأعمال، وخاصة تلك التي تتضمن كميات كبيرة من النصوص غير المهيكلة مثل رسائل البريد الإلكتروني والاستطلاعات ومحادثات الوسائط الاجتماعية وغير ذلك الكثير مع معالجة اللغة الطبيعية، يمكن للشركات تحليل بياناتها بشكل أفضل للمساعدة في اتخاذ القرارات الصحيحة فيما يلي بعض الأمثلة على التطبيقات العملية لـ: NLP

            . الرعاية الصحية : مع انتقال أنظمة الرعاية الصحية في جميع أنحاء العالم إلى السجلات الطبية الإلكترونية، فإنها تواجه كميات كبيرة من البيانات غير المنظمة. يمكن استخدام معالجة اللغة الطبيعية لتحليل والحصول على رؤى جديدة في السجلات الصحية.
            . قانوني : للتحضير لقضية ما، يجب على المحامين في كثير من الأحيان قضاء ساعات في فحص مجموعات كبيرة من المستندات والبحث عن مواد ذات صلة بقضية معينة. يمكن لتقنية NLP أتمتة عملية الاكتشاف القانوني، والتخلص من كل من الوقت والخطأ البشري من خلال التحريك عبر كميات كبيرة من الوثائق.

            . الإدارة المالية : يتحرك العالم المالي بسرعة كبيرة، وأية ميزة تنافسية مهمة في المجال المالي ، يستخدم التجار تقنية NLP لتعدين المعلومات تلقائيًا من مستندات الشركات والإصدارات الإخبارية لاستخراج المعلومات ذات الصلة بحافظاتهم وقراراتهم التجارية.

            . خدمة العملاء : تستخدم العديد من الشركات الكبيرة المساعدين الافتراضيين أو روبوتات المحادثة للمساعدة في الإجابة على استفسارات العملاء الأساسية وطلبات المعلومات (مثل الأسئلة الشائعة)، مع طرح الأسئلة المعقدة على البشر عند الضرورة. . . التأمين : تستخدم شركات التأمين الكبيرة معالجة اللغة الطبيعية للتنقل المستندات عبر والتقارير المتعلقة بالمطالبات، في محاولة لتبسيط طريقة إنجاز الأعمال.

            الاتجاهات الرئيسية لمعالجة اللغات الطبيعية :-

            . المنهج القاعدي أو اللغوي
            . المنهج الأحصائي أو المبني علي المتن أو المكنز أو المدونة اللغوية
            .المنهج المختلط القائم على المنهجين اللغوي والإحصائي

            １-	 المنهج القاعدي

            الأساليب اللغوية المعتمدة على القواعد والمتعلقة بمهام التعرف على كيانات الأسماء مثل الأساليب المستخدمة في نظام استخراج المعلومات ANNIE الخاص بمنصة GATE تتكون عادة من مزيج من معاجم كيانات الأسماء وقواعد مطابقة الأنماط المشفرة يدويا. تستخدم هذه القواعد معلومات مأخوذة من السياق للمساعدة في تحديد ما إذا كانت الكيانات المحتملة الموجودة في معاجم كيانات الأسماء صحيحة، أو لزيادة عدد الكيانات المحتملة تعد معاجم كيانات الأسماء بمنزلة نقطة الانطلاق التي تتيح تأكيد أو رفض أو تنقيح الكيان النهائي الذي ينبغي استخراجه تتكون منظومة التعرف على كيانات الأسماء وتصنيفها عادة من عملية معالجة لغوية مسبقة تجزئة الجمل، تقسيم الجمل، تصنيف أقسام الكلام كما سبق شرحه في الفصل السابق تليها عملية إيجاد الكيان بواسطة معاجم كيانات الأسماء والقواعد النحوية، ثم عملية استخراج الإحالات المشتركة.

            صممت معاجم كيانات الأسماء لإضافة التعليقات والشروحات البسيطة والاعتيادية مثل الأسماء المعروفة للشركات والمواقع وأيام الأسبوع والمشاهير وما إلى ذلك. قد تحتوي معاجم كيانات الأسماء النموذجية الخاصة بالتعرف على كيانات الأسماء وتصنيفها على مئات أو آلاف المدخلات غير أن استخدام معاجم كيانات الأسماء ليس كافيًا بحد ذاته للتعرف على الكيانات وتصنيفها، وذلك لأن الكثير من الأسماء يتسم بالغموض على سبيل المثال: «لندن» قد تكون جزءا من اسم منظمة أو شخص، أو قد تكون المدينة المعروفة ببساطة هذا من ناحية ومن ناحية أخرى، لا يمكنها تحديد كل كيان من كيانات الأسماء (على سبيل المثال في اللغة الإنجليزية لا يمكن للمرء أن يحدد مسبقا جنس كل لقب عائلي. لكن عند دمج معاجم كيانات الأسماء مع حواشي المعالجة اللغوية الأخرى بطاقات تصنيف أقسام الكلام، الأحرف الكبيرة، وغيرها من الأدلة السياقية الأخرى، فإنها قد تكون قوية جدا.

            يجري تطوير الأنظمة القواعدية بناءً على الخصائص اللغوية، مثل بطاقات تصنيف أقسام الكلام أو المعلومات المستنقاة من السياق وبدلاً من وضع هذه القواعد بصورة يدوية، من الممكن وضع علامات على الأمثلة التدريبية، ومن ثم تعلم القواعد بصورة آلية باستخدام أنظمة تعلم القواعد (تعرف أيضا بأنظمة استقراء أو استنتاج الأدلة عن طريق التعلم الخاضع للإشراف، تقوم هذه الأنظمة باستنتاج مجموعات القواعد الأمثلة التدريبية التي وضعت عليها العلامات. كانت هذه الأنظمة تحظى بشعبية في أنظمة التعلم المبكرة التي كانت تستخدم في مهام التعرف على كيانات الأسماء وتصنيفها، وكان من بينها أنظمة من قبيل SRVو
            LP  . و BWI  و  WHISK و  RAPIER
            ２-	المنهج الأحصائي أو المبني علي المتن أو المكنز أو المدونة اللغوية

            لم يكن ممكنا للمعالجة الآلية للغات أن تتقدم وتفتح لنفسها مجالات التطبيق المتنوعة السابقة ثم تستشرف المستقبل بدون أن يكون لها قلب نابض يستوعب مليارات الكلمات والأصوات وتكون لديه القدرة على الوصول إلى أى منها وفهم وتحليل ما بينها من علاقات، ليصبح مع الوقت بيتا للذاكرة ونبع متدفق للمعرفة، وعمليا تجسد هذا القلب النابض فيما يعرف بالمكائز اللغوية Corpora التى تعتمد في عملها على قوة الحاسبات فى المعالجة وقدرات البرمجيات المختلفة في التحليل والفهرسة والرصد والاسترجاع، وسعات وحدات التخزين في استيعاب ما لا حصر له من الكلمات والأصوات فما هي المكانز اللغوية؟

            وفقا لموقع جامعة إيسيكس www.essex.ac.uk ، فإن هذا المصطلح يشير إلى المجموعات الكبيرة من النصوص أو الملفات الصوتية التى تمثل عينة أو تخصص أو شريحة معينة من اللغة، وهذه النصوص تكون غالبا في صيغة الكترونية يستطيع الحاسب قراءتها والبحث فيها، ومن الممكن أن يتكون المكنز اللغوى من نصوص خام فقط بدون أى معلومات أو يحتوى على معلومات لغوية خاصة تسمى بالحواشي أو التلقيب أو الوصف.

            وهي إما مكانز نصية تحتوى على مجموعة هائلة من النصوص المكتوبة والمطبوعة مثل النصوص الكاملة للصحف والمجلات والكتب فى مختلف المجالات مثل الآداب والسياسة والعلوم والفنون أو مكائز صوتية منطوقة تحتوى على تسجيلات آلاف المحادثات والحوارات والخطب ونشرات الأخبار الإذاعية والبرامج الحوارية والمسلسلات والأفلام وغيرها.

            مجالات استخدام المكانز :

            للمكانز دور محوري فى بناء القواميس والمعاجم الحديثة وفى التعرف على خصائص اللغة وكذلك حل مشكلاتها المختلفة، ذكر الباحثون عدة جوانب لأهمية المكائز في الدراسات اللغوية تذكر أهمها فيما يلى: 
            اولا : صناعة المعاجم 

            تساعد المكانز اللغوية على معرفة معلومات غاية فى الأهمية لبناء المعجم وهي متابعة الكلمات الجديدة التى تدخل اللغة وتحديد وقت دخولها، ومعرفة الكلمات الموجودة بالفعل التي اكتسبت معنى جديدا، ونجد أن أغلب قواميس ومعاجم اللغة الإنجليزية تحتوى على تواريخ مفصلة لكل كلمة وأصلها اللغوى ومتى تم نحتها أو استخدامها لأول مرة، وبمساعدة المكانز الالكترونية يستطيع خبراء صناعة المعاجم البحث في ملايين الجمل والسياقات المختلفة واستدعاء جميع الأمثلة لكلمة معينة لمعرفة استخداماتها والألفاظ التي ترد عادة قبلها أو بعدها من أجل تحديد التعابير الاصطلاحية والمتتاليات اللغوية، الأمر الذى يسهل تعلم اللغة على الأجانب.

            ثانيا: المكانز اللغوية وفهم قواعد النحو

            يمكن الاستفادة من المكائز فى دراسة الملامح الصرفية والبحث عن السوابق واللواحق المعينة التي تدخل على الكلمة فكلمة (علم) تتعدد معانيها بإضافة سوابق أو لواحق مختلفة لتصبح (علمية، علمتنا، علماء، تعليم، علوم، بجانب تحديد توزيع الكلمة وموقعها في الجملة، وهل تأتي قبل الاسم أم بعد الاسم، وقبل الصفة أم بعد الصفة.

            ثالثا: المكائز اللغوية وتحديد الدلالة

            في السنوات الأخيرة، ظهر اتجاه جديد يعتمد على استخلاص معنى الكلمة من المكائز اللغوية، وتتنوع المعلومات الدلالية بين الترادف والتضاد إلى علاقات أكثر تعقيدا، ويمكن استخلاص هذه المعلومات بسهولة من المكانز اللغوية، وينبغى التنبيه انه يشترط لاستخراج هذه المعلومات أن تكون المكائز شاملة وكاملة بقدر المستطاع حتى لا يتسرب معنى أو استخدام لا توجد أمثلة له في المكنز. 
            رابعا: المكانز اللغوية وتحسين تعليم اللغات الأجنبية

            من خلال المكانز من الممكن تحليل مدى تكرار وشيوع الكلمات ومعرفة تأثير السياق أو الموقف على أسلوب اللغة وهى معلومات مفيدة للغاية في وضع مناهج تعليم اللغة العربية سواء للطلاب الأجانب أو العرب أنفسهم أيضا باستخدام المكانز اللغوية، يستطيع واضع المراجع والمواد إنشاء تمرينات تعتمد على أمثلة حقيقية تقدم للطلاب فرصة اكتشاف خصائص استخدام اللغة. وبدلا من الاعتماد على البحث فى معاجم تقليدية قديمة، يستطيع الطلاب البحث بأنفسهم في برامج المكانز اللغوية من خلال برنامج بحث وإحصاء لغوى متخصص ( concordance) ويكتشفوا بأنفسهم استخدامات اللغة وقواعدها وخصائصها، ويشجع ذلك على استقلال الطلاب في التوصل إلى نتائج جديدة بدلا من تعليمهم نتائج متوقعة أو معروفة مسبقا.

            خامسا: المكانز اللغوية في مجالات أخرى

            وفي علم اللغويات الاجتماعية، ينصب التركيز على تأثير العمر والنوع والطبقة الاجتماعية والمهنة في استخدام الأفراد للغة، ولا يمكن دراسة ذلك بشكل سريع ودقيق إلا في المكائز اللغوية التي تفيد أيضا فى دراسة الأسلوب وتأثره بالمقام أو مقتضى الحال، فالكتابات الأدبية تختلف عن الكتابات السياسية، والكتابات التعليمية تختلف عن المحادثات العادية، وهكذا، وفي كل الأحوال، ينبغي أن تتسم المكانز اللغوية بالشمول، حتى تكون النتائج التي يتم استخلاصها من الدراسة دقيقة وواقعية.

            المكانز واللغة العربية

            تم تلخيص أهمية المكانز اللغوية لبناء معاجم اللغة العربية في الجوانب التالية:

            １-	حصر جميع المعاني من مميزات البحث الإلكترونى فى المكائز اللغوية إمكانية عرض جميع السياقات التي يمكن أن تظهر فيها الكلمة، وبالتالى إمكانية حصر كل المعاني المختلفة لنفس الكلمة حسب السياقات المختلفة، ومن أمثلة ذلك كلمة (قلب) التى تعنى جوهر وقلب يضخ الدماء ووسط أو منتصف.

            ２-	دراسة مدى شيوع الكلمات تساهم المكانز اللغوية في معرفة أكثر الكلمات شيوعا في اللغة العربية على المستويين المنطوق والمكتوب، وذلك من أجل تعليم هذه الكلمات للأجانب وحتى يتمكنوا من فهم المعاجم العربية، ومما لا شك فيه أن معرفة مستوى شيوع كلمة ما يدل على أهميتها في كل اللغة المكتوبة أو المنطوقة، وبالتالي ترشد المتعلم إلى معرفة مدى ضرورة تعلمها أو إغفالها من عدمه.

            ３-	 دراسة التنويعات المعجمية دراسة تكرار الكلمة كمادة أو كفئة معجمية (اسم، فعل، صفة غير ذلك، ومن الممكن أن يكون للكلمة الواحدة أكثر من فئة معجمية حسب السياق، مثال ذلك كلمة (عين) التي ترد كاسم وكفعل مع التشديد بمعنى (وظف)

            ４-	دراسة استخدام المترادفات تحتوى اللغة على كلمات عديدة تعتبر مترادفات لبعضها البعض، ومن خلال المكنز اللغوى يستطيع الباحث بسهولة معرفة مترادفات الكلمة ومعدل شيوعها.

            ５-	 شكل الكلمة وفقا لحالتها الإعرابية يتغير شكل الكلمة وفقا لحالتها الإعرابية (الرفع والنصب والجر)، ويمكن للباحث من خلال المكنز اللغوى معرفة التنويعات في شكل الكلمة. 

            ６-	دراسة الكلمة وفقا لاشتقاقها الصرفي: فهناك كلمات ذات أكثر من اشتقاق صرفي مثل كتب التي يمكن اشتقاق كاتب وكتاب ومكتبة ومكتوب وغيرها فالمكنز اللغوى يفيد كثيرا في هذه الحالات.

            ７-	معرفة مدى السلامة والصحة اللغوية: أحيانا يكون للكلمة أكثر من جمع أو هي نفسها أكثر من شكل، ويمكن اللجوء إلى ذخيرة المكنز اللغوية الهائلة والبحث فيها لمعرفة أكثر هذه الأشكال شيوعا واستخداما في اللغة، مثل (شهور وأشهر) و (عيون وأعين)، وهكذا.
            ８-	معرفة المتصاحبات اللغوية والتعبيرات الاصطلاحية: هناك أوصاف أو كلمات دائما تقترن بأوصاف أو كلمات أخرى دون سبب ظاهر أو منطقي، مثل تعبيرات فتح الباب على مصراعيه) و (رأب الصدع) و(العروة الوثقى) ودراسة المكائز اللغوية تفيد للغاية في البحث عن أمثلة هذه المتصاحبات من أجل تسجيلها في موادها بالمعجم العربي الحديث. فمثلا في مادة عروة ينبغي أن يذكر القاموس أنه دائما تليها كلمة (وثقى)، وهكذا.

            كيف تم وضع قواعد اللغة العربية منذ أكثر من ألف عام؟ وهل القواعد تسبق الاستخدام أم العكس؟

            من المعروف أن الاستخدام يأتى أولا ثم تأتى القاعدة بعد ذلك، الأمر الذي مكن النحاة الأوائل من وضع القواعد بناء على الاستخدام أو الاستعمال اللغوي، فقاعدة رفع الفاعل ونصب المفعول وجر المضاف إليه جاءت من دراسة استخدام هؤلاء الأفذاذ للاستعمالات اللغوية في أبيات الشعر والحديث والقرآن، وبالمثل يمكن الاستفادة من المكائز اللغوية في استخلاص القواعد اللغوية على مستوى الكلمة والجملة والخطاب والحصول على معلومات عن تركيب واستخدام العديد من التعبيرات اللغوية.

            طرق عمل المكانز :

            １-	جمع المادة النصية عن طريق جمع المادة الالكترونية المتوفرة على الأقراص الضوئية أو الشبكات أو من خلال الإدخال اليدوى عن طريق لوحة المفاتيح و عن طريق تحويل المادة المنطوقة إلى مادة مكتوبة إن وجدت عن طريق المحولات الصوتية وتحويل البيانات الصورة يسهل التعامل معها آليا مثل صيغة النصوص text أو عن طريق جهاز المسح الضوئي الذي يحول النصوص فى المستندات الورقية إلى الصيغة الإلكترونية.

            ２-	 تجهيز المادة اللغوية وهى مرحلة ما قبل المعالجة: يقصد بذلك عزل الجمل وتقسيم الجمل وعزل الصور وتوحيد الخطوط وحجم الخط وخلافه وعزل علاقات الترقيم وتمييز اللبس والاختصارات والقوائم والشروط بأنواعها .
            ３-	إدخال معلومات الوصف والترميز والتلقيب المناسبة : يقصد التلقيب annotation أو الوصف metadata أو الترميز markup تحديد المعلومات اللغوية وبيانات المؤلف وتاريخ الإنشاء والعنوان واللغة والمجال وادخال المعلومات اللغوية مثل فئات أو أقسام الكلام والمشتقات والمعلومات النحوية وبناء الجملة والمعلومات الدلالية ومعلومات عن الأسلوب والصوت بصيغة يفهمها برنامج البحث في المكنز، وسائر أدوات معالجة اللغة، وتتضمن معلومات الوصف تمييز حدود الجمل والعبارات والفقرات وفك لبس حدود الجمل من خلال النقطة والمسافة وتمييز الكلمة الجذر Lemma ومشتقاتها.

            مستويات تحليل اللغات الطبيعية :-

            بالنسبة للنصوص المكتوبة ، فإن تحليها يمر في عدة مراحل تختلف باختلاف طريقة التحليل ، ولكن إحدى معظم أكثر أساليب التحليل إنتشارا تتبع المراحل :

            １-	التحليل الصرفي

            وهو الذي يهتم بمعرفة نوع الكلمات، وضمائرها وغيرها من المعلومات الصرفية كتحديد هل هي جمع أم مفرد صيغة تذكير أم تأنيث صيغة ماضي أم مضارع بالإضافة إلى تحديد أصل الكلمة والزوائد الدخيلة عليها.

            ２-	 التحليل النحوي

            وهو المعتمد على التحليل الصرفي، ويهتم بهيكلة الجملة وعلاقة كلمات بعضها مع بعض وغيرها من المعلومات النحوية كتحديد الفعل والفاعل والمفعول به لتحليل البنية النحوية للجملة إن كانت اسمية أو فعلية أو مشروطة محددا أداة الشرط وجواب الشرط.

            ３-	التحليل الدلالي

            المعتمد على المرحلتين السابقتين، ويهتم بقصد الجملة عن طريق الربط وهو المنطقي بالمعلومات الموجودة في الجملة وبين العالم الواقعي .

            المنهجيات المتبعة في المعالجة اللغوية في اللغة العربية :-

            هناك نوعان رئيسان من المنهجيات المتبعة في مهام المعالجة اللغوية: أحدهما منهجية قائمة على المعرفة والآخر منهجية مبنية على التعلم، علما أنه يمكن أيضا دمجهما معا، هناك مزايا وعيوب لكل منهجية، ملخصة في الجدول التالي

            المنهجية القائمة على المعرفة أو القائمة على القواعد تعد من الأساليب التقليدية بصفة عامة وقد حلت محلها في كثير من الحالات منهجيات التعلم الألي نظرا لأن عملية معالجة كميات هائلة من البيانات بسرعة وكفاءة لم تعد تشكل معضلة بقدر ما كان الأمر عليه في الماضي، تستند المنهجية القائمة على المعرفة على قواعد مكتوبة بدوياً، وتجري كتابة هذه القواعد عادة على يد متخصصين في مجال معالجة اللغات الطبيعية وتتطلب معرفة قواعد اللغة والمهارات اللغوية، فضلا عن امتلاك ملكة البديهة. تكون هذه المنهجيات ذات فائدة أكبر إن أمكن تعريف المهمة بسهولة بواسطة القواعد ( على سبيل المثال قاعدة الاسم الصحيح – في اللغة الإنجليزية يبدأ دائما بحرف (بير»)، وفي العادة، يمكن استثناء هذه القواعد بسهولة. عندما لا تنطبق القاعدة اللغوية بشكل مباشر تولد هذه المنهجية إشكالية أكبر من السابق ( على سبيل المثال: في تغريدات تويتر غالبا لا يستخدم الناس الأحرف الكبيرة لكتابة الأسماء الصحيحة في اللغة الإنجليزية). من بين المزايا الكبيرة للمنهجية القائمة على المعرفة السهولة الكبيرة في فهم النتائج. عندما يتعرف النظام على شيء ما بشكل غير صحيح، يكون بوسع المطور التحقق من القواعد وتحديد سبب حدوث الخطأ، ومن ثم يحتمل أن يكون بمقدوره تصحيح القواعد أو كتابة قواعد إضافية لحل المشكلة. ومع ذلك، يمكن أن تستهلك عملية كتابة القواعد الكثير من الوقت، وفي حال حدوث تغيير في المهمة، فقد يضطر المطوّر إلى إعادة كتابة العديد من القواعد

            منهجيات تعلم الآلة تحظى بشعبية أكبر في الأونة الأخيرة مع ظهور أجهزة قوية ومتطورة وأيضا بسبب عدم وجود ضرورة لامتلاك خبرة في المجال المعني أو امتلاك معرفة لغوية، ولذلك أصبح بالإمكان أن تنشئ نظامًا خاضعا للإشراف بسرعة كبيرة إذا توفرت بيانات تدريبية كافية، وبوسعنا الحصول على نتائج معقولة بعد تدريب محدود جدا. غير أن الحصول على بيانات تدريبية كافية أو إنشاءها غالبا ما يطرح إشكالية كبيرة للغاية ويستغرق وقتا طويلا  

            ولا سيما إذا كان لا بد من القيام بهذه العملية يدويا. يعني هذا الاعتماد على بيانات التدريب أيضا أن التكيف مع أنواع جديدة من النصوص أو المجالات أو اللغات سيكون مكلفا على الأرجح، حيث يتطلب توفر قدر كبير من بيانات التدريب الجديدة. لذا، فإن القواعد التي يكون البشر قادرين على قراءتها عادة ما تكون أسهل في التكيف مع اللغات وأنواع النصوص الجديدة مقارنة بتلك المبنية على أساس النماذج الإحصائية. كما يمكن معالجة مشكلة توفر بيانات التدريب الكافية عبر الدمج بين التعلم الآلي والطرق غير الخاضعة أو شبه الخاضعة للإشراف مع العلم أنها عادة ما تعطي نتائج أقل دقة مقارنة بنتائج التعلم الخاضع للإشراف

            تصنيف أقسام الكلام Part of speech tagging :-

            تحتاج الآلات عند التعامل مع اللغة أو النصوص إلى تحديد أو تصنيف أقسام الكلام، وهو ما يتم من خلال تقنية تصنيف اقسام الكلام Part of speech tagging ، إذ يتم تقسيم الجملة إلى أجزائها من أفعال وصفات وأسماء وأحوال وغيرها، وهذا ما يساعد الآلة على الفهم الصحيح للنص أو الصوت الذي يرسله لها الإنسان.
            فك التباس معاني الكلمات Word Sense Disambiguation أو WSD :-

            بعض الكلمات لديها العديد من المعاني بل ولديها العديد من الأشكال النحوية (اسم، فعل، ....) وهو ما قد يسبب التباس للآلة، ويتطلب استخدام خوارزميات محددة من أجل معالجة هذه المشكلة

            تقنية فك التباس معاني الكلمات Word Sense Disambiguation أو WSD تتعامل مع سياق الجملة، ومن خلاله تستطيع أن تحدد المعنى المراد والمقصود لهذه الكلمة، ويتم هذا من خلال نماذج إحصائية معقدة مع ترجيح الكلمات ذات نسب الترجيح الأكبر.

            ويمكن القول بأن هذه التقنية هي ما تمكن الآلة من الحصول على حس لمعنى الكلمات والتفرقة بينها أي أنها من أهم التقنيات التي تجعل الآلة تفهم اللغة الطبيعية.

        `,
    },
    {
        "id":3,
        "type": "ques",
        "ques": [
            {
                "id": 0,
                "ques": "ماهي معالجة اللغة الطبيعيه NLP؟",
                "answer": "هى العلم الذي يجمع بين اللغة وعدد من مجالات علم الحاسب الآلى مثل : تعلم الآلة ، التعلم العميق،الشبكات العصبية الصناعية .",
                "key": ["إجابة", "الأول"],
                "notes": "معالجة اللغة الطبيعيه هى العلم الذي يجمع بين اللغة وعدد من مجالات علم الحاسب الآلى مثل : تعلم الآلة ، التعلم العميق،الشبكات العصبية الصناعية ."
            },
            {
                "id": 1,
                "ques": "اذكر أهمية برمجيات معالجة اللغات الطبيعية ؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "تجعل الحوار بين الإنسان والآلة ممكنا بلغة اقرب ما تكون إلى اللغات الطبيعية التى يستخدمها فى الحوار مع أقرانه باستخدام الذكاء الاصطناعي ."
            },
            {
                "id": 2,
                "ques": "عرف المعالجة الآلية للغات الإنسانية ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "هو مجال فرعى يتبع الذكاء الاصطناعي و اللغويات الحاسوبية ويعنى بدراسة مشكلات التوليد والفهم الآلى للغات الإنسانية الطبيعية وتهدف انظمة توليد اللغات الطبيعية إلى تحويل البيانات والمعلومات المخزنة في قواعد بيانات الحاسب إلى لغة بشرية تبدو طبيعية ."
            },
            {
                "id": 3,
                "ques": "اذكر استخدامات تقنية معالجة اللغة الطبيعية ؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "محركات البحث ، انظمة الكتابة ، تصحيح الأخطاء فى لوحات كتابة الهواتف المحمولة ، البحث الطبى ، مجالات المال والاعمال والبحث الأكاديمي ."
            },
            {
                "id": 4,
                "ques": "قارن بين اللغة الطبيعية واللغه الاصطناعية ؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "اللغة الطبيعية هى اللغات البشرية كالعربية والإنجليزية التى نشأت وتطورت بدون تخطيط أو قواعد موضوعة مسبقا ولديها العديد من اللهجات المحلية والعامية المختلفة كما أنها تتطور تلقائيا ولذا تتطلب تحديثا فى استخراج قواعدها مع مرور الوقت ."
            },
            {
                "id": 5,
                "ques": "اذكر الأهداف المعالجة الآلية للغات الإنسانية ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "تواصل افضل مع الحاسب ."
            },
            {
                "id": 6,
                "ques": "ما هى اسباب الاهتمام بمعالجة اللغات الطبيعية ؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "التطور الهائل فى علوم اللغويات و خضوعها للمعالجة الرياضية والمنطقية "
            },
            {
                "id": 7,
                "ques": "اذكر انواع معالجة اللغة الطبيعية NLP ؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "توليد اللغة الطبيعية وهى التقنية التى تتيح للآلة بأن تستطيع توليد محتوى سواء نصي أو صوتى يشابه الذى قد يولده الإنسان العادى اي ان هذه التقنية تتعامل مع الآلة مع اللغة على أنها مخرجات لا مدخلات ."
            },
            {
                "id": 8,
                "ques": "اذكر تطبيقات معالجة اللغة الطبيعية ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "التعرف على الكلام ."
            },
            {
                "id": 9,
                "ques": "اذكر التقنيات الفرعية لتصنيف النصوص  ؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "تصنيف الموضوعات ."
            },
            {
                "id": 10,
                "ques": "تكلم عن كيفيه استخلاص الكلمات المفتاحيه؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "تقوم هذه التقنيه بشكل اتوماتيكي ان تقوم باستخلاص اهم الكلمات المفتاحيه والتعبيرات في نص او مجموعة من النصوص ويتم استخدام هذه التقنيه بكثره في محركات البحث"
            },
            {
                "id": 11,
                "ques": "في ماتستخدم تطبيقات الترجمه الالية ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "المساعده على الفهم"
            },
            {
                "id": 12,
                "ques": "كيفيه استخدام تطبيق التعرف الضوئي على الحروف ؟",
                "answer": "هى العلم الذي يجمع بين اللغة وعدد من مجالات علم الحاسب الآلى مثل : تعلم الآلة ، التعلم العميق،الشبكات العصبية الصناعية .",
                "key": ["إجابة", "الأول"],
                "notes": "وذلك من خلال بعض التعديلات المتطورة حيث بلغت مكانه كبيره في شأوا في اللغات اللاتينية وفي اللغه العربيه أيضا وغير انها باهظه التكلفه وقليله الانتشار ومازلت مجال للبحث النشط سواء في اللغات اللاتينية او العربيه"
            },
            {
                "id": 13,
                "ques": "كيف يتم تحويل النص الي كلام منطوق؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "تتم ذلك من خلال قراءه النصوص او تحويل الكلام المكتوب الي صوت مسموع وكلام منطوق مفهوم وبذلك يسمى بنظام الحاسب او مؤلف الكلام وتحويل الكلام العادي الي لغه منها الرموز اللغويه الصوتيه الي كلام محزن في قاعده البيانات ويمكن معرفته في نموذج جهاز النطق ومعرفه الكلمه المراده"
            },
            {
                "id": 14,
                "ques": "اذكر بعض من التطبيقات التي يتم في معالجه النصوص؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "التطبيقات الطبيه الحيوية"
            },
            {
                "id": 15,
                "ques": "كيفيه الاستفاده من التطبيقات التسوقيه؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "يتم الاستفاده منها من خلال التعرف على طبيعه علاقه الشركات بعملائهم او ارائهم وانطباعهم حول منتجات وخدمات الشركات"
            },
            {
                "id": 16,
                "ques": "من أحدي مجالات معالجه اللغه الطبيعيه الرعايه الصحيه كيف تتم ذلك ؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "وذلك من خلال استخدام معالجه اللغه الطبيعيه لتحليل والحصول على رؤي جديده في السجلات الصحيه والاهتمام بيها"
            },
            {
                "id": 17,
                "ques": "ماهو تطبيق المحادثات وكيف يتم؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "هو َواحد من أكثر التطبيقات معالجه اللغه الطبيعيه شهره حيث من خلال الخوارزميات الذكيه يمكنك بسهوله توفير ذكاء اصطناعي يرد على عملائك بذكاء بشري كما يمكن توفير انظمه خبراء قادره علي الاجابه على جميع الاسئله الموجودة"
            },
            {
                "id": 18,
                "ques": "كيفيه استخلاص الأسماء ذات الدلالات التي هي من أحدي تطبيقات لمعالجة النصوص؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "وذلك ان هذه التقنيه لا يمكن الاستغناء عنها لأنها هامه جدا اذا انها تجعل الاله قادره على التجاوب بشكل أفضل مع اللغه الطبيعيه حيث انها تسطيع استخلاص الكلمات المقصوده بها دلالات أخرى مثل ان تكون اسم لشخص مشهور او اسم فليم او مكان أو مسلسل وهكذا"
            },
            {
                "id": 19,
                "ques": "كيفيه تحليل المشاعر وكيف تتم ؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "تحليل المشاعر هي واحده من أشهر تقنيات الNlp وأن هذه التقنيه تحاول فهم المشاعر التي تكمن وراء النصوص وتحدد الموافق الناتجه عنها سواء كانت معينه او حيره او سخريه وماالي ذلك وتعمل هذه الخاصيه على الرد التلقائي على العملاء والمدح والشاوي وغير ذلك بالطرق المناسبه حسب الأوامر المحدده من قبل الشركه"
            },
            {
                "id": 20,
                "ques": "كيفية تصنيف أقسام الكلام ؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "استخراج اقسام الكلام من النص (اقسام الكلام مثل فعل ماض، فعل مضارع، فعل امر، صفه، اسم حال) فيتم تصنيف كل كلمه في النص الي القسم الذي يمثلها "
            },
            {
                "id": 21,
                "ques": "ما هوا فك التباس معني الكلمات WSD ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "هو استخلاص المعني الصحيح من الكلمه وفقا للسياق  ويتطلب استخدام خورزميات محدده من اجل معالجعة المشاكل  "
            },
            {
                "id": 22,
                "ques": "كيفية استخدام معالجة البيانات ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "تقوم برمجيات معالجة اللغات الطبيعية NLP باستخدام المعالجة المسبقة مثل الترميز،  وتحديد الجذر اللغوي، والتصرف، واستبعاد كلمات التوقف لتجهيز البيانات لمختلف التطبيقات "
            },
            {
                "id": 23,
                "ques": "ما التحديات التي تواجه معالجة اللغة الطبيعية NLP ؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes":" الدقة و اللهجات واللغات العامية و مشاكل تقسيم الجمل"
                
            },
            {
                "id": 24,
                "ques": "ما التي تحتويه اللهجات  الطبيعية واللغات العامية ؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "اللغات الطبيعية تحتوي علي الكثير من اللهجات، فاللغة العربية الخاصة بنا تنقسم لمئات اللهجات المحلية وهناك اللهجة السعودية واللهجة التونسيه وغيرها من اللغات العربيه لذا فإن العلماء يركزون علي اللغات الفصحي "
            },
            {
                "id": 25,
                "ques": "ما الطريقة التي تفهم بها الألة الجملة ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "نحن كبشر نستخدم التعبيرات المجازيّة في احاديثنا اليومية، والتي نستطيع نحن البشر فهمها والتعامل معها، والرد بالردود المناسبه."
            },
            {
                "id": 26,
                "ques": "ما هيا خطوات تنفيذ معالجة اللغات الطبيعية NPL ؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "في المعتاد، تبدا عملية معالجة اللغات الطبيعية(NPL) بجمع وإعداد بيانات نصيه او كلامية غير مهيكلة من مصادر مثل مستودعات البيانات السحابية او تطبيقات عمليات الأعمال الداخلية او رسائل البريد الإلكتروني"
            },
            {
                "id": 27,
                "ques": "ما هيا المهام المطلوبة لمعالجة اللغات الطبيعية (NPL) ؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "فيها تساعد الكمبيوتر في فهم كيفية تكون الكلمات  علاقات ذات المعني مع بعضها البعض"
            },
            {
                "id": 28,
                "ques": "ما هيا طرق معالجة اللغة الطبيعية الخاضعة للإشراف؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "تقوم معالجة اللغة الطبيعية الخاضعة للإشراف بتدريب البرنامج بمجموعه من المدخلات والمخرجات  المعروفة. ويقوم البرنامج اولا بمعالجة كميات كبيرة من البيانات ويتعلم كيفية انتاج المخرجات الصحيحة من اي ادخال غير معروف.  "
            },
            {
                "id": 29,
                "ques": "ما هيا طرق معالجة اللغة الطبيعية غير الخاضعة للإشراف ؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "تستخدم معالجة اللغة الطبيعية غير خاضعة للإشراف نموذج لغة إحصائية للتنبؤ  بالنمط الذي يحدث عندما يتم تغذيته بواسطة مدخلات غير مسماه."
            },
            {
                "id": 30,
                "ques": "ما هيا الاتجاهات الرئيسية لمعالجة اللغات الطبيعيه؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "المنهج المختلط القائم علي المنهجين اللغوي والإحصائي"
            },
            {
                "id": 31,
                "ques": "ما هي الاساليب اللغويه المعتمده علي القواعد ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "المنهج القاعدي اساليب متعلقه بمهام التعرف علي كيانات الاسماء مثل الأساليب المستخدمه في نظام استخراج المعلومات ANNIE الخاص بمناصة GATE"
            },
            {
                "id": 32,
                "ques": "ما هي مجالات استخدام المكانز ؟",
                "answer": "هى العلم الذي يجمع بين اللغة وعدد من مجالات علم الحاسب الآلى مثل : تعلم الآلة ، التعلم العميق،الشبكات العصبية الصناعية .",
                "key": ["إجابة", "الأول"],
                "notes": "تساعد المكانز اللغويه علي معرفة معلومات غاية في الاهميه لبناء المعجم وهيا متابعة الكلمات الجديدة التي تدخل اللغه وتحديد وقت دخولها."
            },
            {
                "id": 33,
                "ques": "اهمية المكانز اللغوية في بناء معجم بالغه العربية ؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "حصر جميع المعاني: من مميزات البحث الألكترونيّ في المكانز اللغويه امكانية عرض جميع السياقات التي يمكن ان تظهر فيها الكلمه"
            },
            {
                "id": 34,
                "ques": "ما هيا المتصاحبات اللغويه والتعبيرات الاصلاحية ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "هوا تركيب لغوي تؤدي كلماته مجتمعه معني لا صله له بمعني كل كلمه مفرده وهوا تعبير لا يقبل بالغير بين كلماته استبدالا او تقديما او تاخيرا او حذفا او غير ذلك من اشكال التغيير"
            },
            {
                "id": 35,
                "ques": "كيف تم وضع قواعد اللغة العربية ؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "قاعدة رفع الفاعل ونصب المفعول وجر المضاف اليه جاءت من دراسة  ابيات الشعر والقرانوالأحديث "
            },
            {
                "id": 36,
                "ques": "ما هي مستويات تحليل اللغات الطبيعية ؟",
                "answer": "إجابة السؤال الثاني",
                "key": ["إجابة", "الأول"],
                "notes": "التحليل المصرفي"
            },
            {
                "id": 37,
                "ques": "ما هوا التحليل الصرفي وكيف يهتم بمعرفة نوع الكلمات ؟",
                "answer": "إجابة السؤال الثالث",
                "key": ["إجابة", "الأول"],
                "notes": "هوا تحليل يهتم بمعرفة ضمائر الكلمات وغيرها من المعلومات المصرفيه كتحديد هل هيا جمع ام مفرد صيغة تذكير ام تأنيب صيغة ماضي ام مضارع بالإضافة الي تحديد اصل الكلمه والزوائد الداخلية عليها"
            },
            {
                "id": 38,
                "ques": "ما المنهجيات المتابعه في المعالجة اللغويه في اللغه العربيه ؟",
                "answer": "إجابة السؤال الأول",
                "key": ["إجابة", "الأول"],
                "notes": "هناك نوعان رئيسان احدهما منهجيه قائمه علي المعرفه والأخري منهجيه مبنيه علي التعلم  المنهجيه القائمه علي المعرفه هيا قواعد مكتوبه يدويا وتجري كتابة هذة القواعد عادة علي يد متخصصين ومن بين مزاياها الكبيره السهوله الكبيره في الفهم النتائج "
            },
        ],
    },
    {
        "id":4,
        "type": "lesson",
        "title": "العنوان الرئيسي 4",
        "video": "../static/video/awesome-video.mp4",
        "sub-title": "عنوان فرعى",
        "desc": "من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك.",
        "innerHTML":`
        <h1 class="title"> 4 العنوان الرئيسي </h1>
        <div class="video">
            <video controls="" autoplay="" name="media"></video>
        </div>
        <div class="info">
            <h2> عنوان فرعى</h2>
            <p class="desc">
                من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك.
            </p>
        </div>
        `
    },
    {
        "id": 5,
        "type": "lesson",
        "title": "العنوان الرئيسي 5",
        "video": "../static/video/awesome-video.mp4",
        "sub-title": "عنوان فرعى",
        "desc": "من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك.",
        "innerHTML":`
        <h1 class="title"> 5 العنوان الرئيسي </h1>
        <div class="video">
            <video controls="" autoplay="" name="media"></video>
        </div>
        <div class="info">
            <h2> عنوان فرعى</h2>
            <p class="desc">
                من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك.
            </p>
        </div>
        `
    },
    {
        "id": 6,
        "type": "lesson",
        "title": "العنوان الرئيسي 6",
        "video": "../static/video/awesome-video.mp4",
        "sub-title": "عنوان فرعى",
        "desc": "من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك.",
        "innerHTML":`
        <h1 class="title"> 6 العنوان الرئيسي </h1>
        <div class="video">
            <video controls="" autoplay="" name="media"></video>
        </div>
        <div class="info">
            <h2> عنوان فرعى</h2>
            <p class="desc">
                من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك. من المهم جدًا أن ينتبه العميل لعملية اشتقاق الدهون. يقال إنها هي نفسها مناسبة لهما ، لكن لا أحد يريد أن يتزوجها من البعض ، من زوجها ، بسرور إيجاد أي هروب منهم ما لم يوفروا ذلك.
            </p>
        </div>
        `
    },
    {
        "id":7,
        "type": "ques",
        "ques": [
            [
                "إجابة",
                "الأول"
            ],
            [
                "إجابة",
                "الأول"
            ],
            [
                "إجابة",
                "الأول"
            ],
            true,
            true,
            true,
            true,
            "1",
            "1",
            "1",
        ],
        "innerHTML":`
        <h1 class="title"> الامتحان </h1>
        <form id="ques">
        <div class="textarea">
            <label for="ques-1"> السوال الأولى </label>
            <textarea name="ques-1" id="ques-1"></textarea>
        </div>
        <div class="textarea">
            <label for="ques-2"> السوال الثانى </label>
            <textarea name="ques-2" id="ques-2"></textarea>
        </div>
        <div class="textarea">
            <label for="ques-3"> السوال الثالث </label>
            <textarea name="ques-3" id="ques-3"></textarea>
        </div>
        <div class="checkboxs">
            <div class="checkbox">
                <label for="ques-4" > السوال الرابع </label>
                <input type="checkbox" name="ques-4" id="ques-4">
            </div>
            <div class="checkbox">
                <label for="ques-5" > السوال الرابع </label>
                <input type="checkbox" name="ques-5" id="ques-5">
            </div>
            <div class="checkbox">
                <label for="ques-6" > السوال الرابع </label>
                <input type="checkbox" name="ques-6" id="ques-6">
            </div>
            <div class="checkbox">
                <label for="ques-7" > السوال الرابع </label>
                <input type="checkbox" name="ques-7" id="ques-7">
            </div>
        </div>
        <div class="radio">
            <label for="ques-8"> السوال الثامن </label>
            <div>
                <input type="radio" name="ques-8" value="1" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
            <div>
                <input type="radio" name="ques-8" value="2" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
            <div>
                <input type="radio" name="ques-8" value="3" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
            <div>
                <input type="radio" name="ques-8" value="4" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
        </div>
        <div class="radio">
            <label for="ques-8"> السوال الثامن </label>
            <div>
                <input type="radio" name="ques-9" value="1" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
            <div>
                <input type="radio" name="ques-9" value="2" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
            <div>
                <input type="radio" name="ques-9" value="3" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
            <div>
                <input type="radio" name="ques-9" value="4" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
        </div>
        <div class="radio">
            <label for="ques-8"> السوال الثامن </label>
            <div>
                <input type="radio" name="ques-10" value="1" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
            <div>
                <input type="radio" name="ques-10" value="2" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
            <div>
                <input type="radio" name="ques-10" value="3" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
            <div>
                <input type="radio" name="ques-10" value="4" id="">
                <label for="ques-8"> السوال الثامن </label>
            </div>
        </div>
        <div class="send">
            <input id="send" type="submit" value="أرسل">
        </div>
    </form>
    `
    },
    
]

// {
//     "id":3,
//     "type": "ques",
//     "ques": [
//         [
//             "إجابة",
//             "الأول"
//         ],
//         [
//             "إجابة",
//             "الأول"
//         ],
//         [
//             "إجابة",
//             "الأول"
//         ],
//         [
//             "إجابة",
//             "الأول"
//         ],
//         [
//             "إجابة",
//             "الأول"
//         ],
//         [
//             "إجابة",
//             "الأول"
//         ],
//         [
//             "إجابة",
//             "الأول"
//         ],
//         [
//             "إجابة",
//             "الأول"
//         ],
//         [
//             "إجابة",
//             "الأول"
//         ],
//         [
//             "إجابة",
//             "الأول"
//         ]
//     ],
//     "notes":[
//         "نص الملاحظة 1",
//         "نص الملاحظة 2",
//         "نص الملاحظة 3",
//         "نص الملاحظة 4",
//         "نص الملاحظة 5",
//         "نص الملاحظة 6",
//         "نص الملاحظة 7",
//         "نص الملاحظة 8",
//         "نص الملاحظة 9",
//         "نص الملاحظة 10",
//     ],
//     "innerHTML":`
//     <h1 class="title"> الامتحان </h1>
//     <form id="ques">
//     <div class="textarea">
//         <label for="ques-1"> السوال الأولى </label>
//         <textarea name="ques-1" id="ques-1"></textarea>
//     </div>
//     <div class="textarea">
//         <label for="ques-2"> السوال الثانى </label>
//         <textarea name="ques-2" id="ques-2"></textarea>
//     </div>
//     <div class="textarea">
//         <label for="ques-3"> السوال الثالث </label>
//         <textarea name="ques-3" id="ques-3"></textarea>
//     </div>
//     <div class="textarea">
//         <label for="ques-4"> السوال الأولى </label>
//         <textarea name="ques-4" id="ques-4"></textarea>
//     </div>
//     <div class="textarea">
//         <label for="ques-5"> السوال الثانى </label>
//         <textarea name="ques-5" id="ques-5"></textarea>
//     </div>
//     <div class="textarea">
//         <label for="ques-6"> السوال الثالث </label>
//         <textarea name="ques-6" id="ques-6"></textarea>
//     </div>
//     <div class="textarea">
//         <label for="ques-7"> السوال الأولى </label>
//         <textarea name="ques-7" id="ques-7"></textarea>
//     </div>
//     <div class="textarea">
//         <label for="ques-8"> السوال الثانى </label>
//         <textarea name="ques-8" id="ques-8"></textarea>
//     </div>
//     <div class="textarea">
//         <label for="ques-9"> السوال الثالث </label>
//         <textarea name="ques-9" id="ques-9"></textarea>
//     </div>
//     <div class="textarea">
//         <label for="ques-10"> السوال الثالث </label>
//         <textarea name="ques-10" id="ques-10"></textarea>
//     </div>
//     <div class="send">
//         <input id="send" type="submit" value="أرسل" onsubmit="send()">
//     </div>
// </form>
// `
// }